In [1]:
import numpy as np
import pandas as pd
import sys
import time

In [2]:
l=[1,2,3,'4']
n=np.array([1,2,3,'4'])
print(l,type(l))
print(n,type(n))

[1, 2, 3, '4'] <class 'list'>
['1' '2' '3' '4'] <class 'numpy.ndarray'>

In [3]:
l=[[1,2,3,4],[5,6,7,8]]
n=np.array([[1,2,3,4],[5,6,7,8]])

In [4]:
n*2

array([[ 2,  4,  6,  8],
       [10, 12, 14, 16]])

In [5]:
l1=[[1,2,3,4],[5,6,7,8]]
l2=[[1,2,3,4],[5,6,7,8]]
n1=np.array([[1,2,3,4],[5,6,7,8]])
n2=np.array([[1,2,3,4],[5,6,7,8]])

In [6]:
l1+l2

[[1, 2, 3, 4], [5, 6, 7, 8], [1, 2, 3, 4], [5, 6, 7, 8]]

In [7]:
n1+n2

array([[ 2,  4,  6,  8],
       [10, 12, 14, 16]])

In [8]:
c=[20.1,34.5,21.7,18.9,29.0]
n=np.array(c)
f=n*(9/5)+32

In [9]:
f

array([68.18, 94.1 , 71.06, 66.02, 84.2 ])

In [10]:
x=list(range(1,100001))
y=np.array(range(1,100001))
print(sys.getsizeof(1)*len(x))
print(y.itemsize*y.size)

2800000
400000

In [12]:
s=10000001
l1=list(range(s))
l2=list(range(s))
start=time.time()
res1=[x+y for x,y in zip(l1,l2)]
end=time.time()
print((end-start)*1000)

28333.001852035522

In [13]:
n1=np.array(range(s))
n2=np.array(range(s))
start=time.time()
res2=n1+n2
end=time.time()
print((end-start)*1000)

1218.8096046447754

In [14]:
data=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
data['d']

4

In [16]:
print(data.dtype)
print(data.size)
print(data.ndim)
print(data.shape)

int64
5
1
(5,)

In [29]:
df=pd.DataFrame(['Hyd','Bang','DL','AP'],index=[1,2,3,4])
df

      0
1   Hyd
2  Bang
3    DL
4    AP

In [30]:
active=[100,200,300,400]
df[1]=active

In [31]:
df

      0    1
1   Hyd  100
2  Bang  200
3    DL  300
4    AP  400

In [32]:
df.columns=['cities','activecases']

In [33]:
df

  cities  activecases
1    Hyd          100
2   Bang          200
3     DL          300
4     AP          400

In [34]:
df['cities'][2]

'Bang'

In [35]:
df['cities'][2]='Banglore'

<ipython-input-35-209f4cf84b87>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['cities'][2]='Banglore'

In [36]:
df

     cities  activecases
1       Hyd          100
2  Banglore          200
3        DL          300
4        AP          400